// 1)
// //Что такое Jquery?
// Это библиотека для упрощения кода Js

// 2)
// //В чем польза Jquery?
// Он упрощает написание кода, и код становаться короче

// 3)
// //Какие функции содержит в себе Jquery?
// $()
// .addClass()
// .removeClass()
// .toggleClass()
// .css()
// .html()
// .text()
// .val()
// .append()
// .remove()
// .hide()
// .show()

// 4)
// //Какие известные компании используют Jquery?
// Google
// Facebook
// Microsoft
// Amazon
// Twitter
// Adobe
// WordPress
// LinkedIn
// IBM
// eBay

// 5)
// //Куда нужно подключать Jquery?
// в файле html в <head>

// 6)
// //В какую папку нужно поместить скаченый Jquery?
// script

// 7)
// //Как лучше подключать Jquery?
// CDN

// 8)
// //Как выглядит базовый синтаксис Jquery?
// $(document).ready(function() {
// Код
// })

// 9)
// //Что делает метод $(this).hide() ?
// Скрывает текущий элемент

// 10)
// //Что делает метод $("p").hide() ?
// скрывает все элементы p

// 11)
// //Что делает метод $(".test").hide() ?
// скрывает все элементы с классом .test

// 12)
// //Что делает метод $("#test").hide() ?
// удаляет элемент с ID #test

// 13)
// //Пропиши ниже событие готовности верстки в Jquery
// $(document).ready(function() { 

// })
// 14)
// //Пропиши ниже событие готовности верстки в Jquery коротко
// $(function() { 

// })
// 15)
// //Для чего нужны селлекторы в Jquery?
// для выбора одного или нескольких элементов на веб-странице.

// 16)
// //Догадайся что делает скрипт ниже
// $(document).ready(() => {
//     $('.button').click(() => {
//         console.log('Hello')
//     })
// })
// По нажатию на кнопку с классом .button код вывдодит Hello

// 17)
// //Как в Jquery обратится к селлектору id?
// $(#айди)
// 18)
// //Как в Jquery обратится к селлектору class?
// $(.класс)
// 19)
// //Перечисли ниже все селлекторы Jquery которые есть, а не те которые помнишь!
// Элементы
// Идентификаторы
// Классы
// Дочерние элементы
// Потомки
// Псевдоклассы
// Атрибуты
// Фильтры